{"data":{"contentfulBlogPost":{"title":"My Programming Experience","slug":"my-programming-experience","publishDate":"1500411600000","content":[{"__typename":"ContentfulBlogPostCopy","id":"b159d621-8227-5cd0-a0d3-f559c4a735f8","copy":{"childMarkdownRemark":{"html":"<p>Hi, there! I will begin with explaining how I started my way in programming.</p>\n<p><em>In the far 2008th</em>, I entered to Kazakh-Turkish High School for gifted students. All Kazakh-Turkish Schools in our country make a big emphasis on subject Olympiads. Our school was not an exception. In the first quarter, after 2-3 weeks of study, you write a test and choose 3 subjects that you want to study deeply, to go to Olympiad. My first priority subject was <strong>English</strong>. I really liked it. And I had good results than my classmates on lessons. But there was too many students in that subject, so I became a Olympiad student of <strong>Informatics</strong> - my second priority. That is how I began IT geek.</p>\n<p>I started learning <em>C++</em> very deeply, and all algorithms, graphs, trees and etc. Sometimes, I even won some awards in regional and republic Olympiads. But after 3 years, it started to annoy me, because I learned ACM programming, but could not see the application of it in real life. In 10th grade I downloaded <strong>PHP and MySQL course</strong> from Evgenyi Popov. That was my first steps in Web-programming. I built some simple websites in the end of this course.</p>\n<p><em>In 2013</em>, I entered Suleyman Demirel University, to Engineering Faculty, Information Systems department. The lessons were easy, because I already had 5 years of experience in programming, while most of my groupmates had no experience in programming. I entered IT-club - local club in University for those who interested in IT. There was many sections like, Web, iOS, Android, Game Dev. I liked Android, so I went to that section. </p>\n<p>I went to <strong>Android Development</strong>. That was not so hard. Having experience in programming helped me with that. So learning curve had a steep growth in the beginning for me. </p>\n<p><em>After a year</em>, I started taking projects for freelance. They were small projects but helped me gaining experience in Android Development. <a href=\"https://developer.android.com/index.html\">Android Developers Site</a> was my favorite site. Mostly I was self-taught developer, and never know how to write perfect code. I read blogs of Android Developers to gain more experience and learn to write perfect code. These blogs are <a href=\"https://fernandocejas.com/\">Fernando Cejas</a> (lead engineer at SoundCloud), <a href=\"http://www.curious-creature.com/\">Romain Guy</a> (Software Engineer at Google), <a href=\"http://hannesdorfmann.com\">Hannes Dorfmann</a> (Software Engineer, Open Source contributor, after of MVP Mosby framework), <a href=\"http://www.dmytrodanylyk.com/\">Dmitro Danylyk</a> (Google Developer Expert) and others.</p>\n<p><em>Along with this</em>, I did not end up with Web development. It was always interesting for me, so I also was interested in this sphere. In university I took course where I got to know with <strong>ReactJS</strong> and other <em>JavaScript</em> libraries. Then I worked as <em>Web Developer</em> in \"SOFT IT\" LLC, where I furthered my knowledge in Web development.</p>\n<p><em>In 2016</em>, one company invited me to position of Android Developer. The company was <a href=\"http://mars.studio/\">Mars Studio</a> - they develop mobile applications, mostly for other Businesses(B2B). After a month, I was promoted to Lead Android Developer. I had more responsibility and I liked it. But those days I really wanted to be free, and start own business, <strong>become an entrepreneur</strong>. I quit a job, after I finished last application and started building own business. </p>\n<p> I had my ups and downs and now I almost lost everything. Entrepreneur inside me did not let me go to work, and work for someone. Now I start to understand that I want to be an expert in one field. I am young and everything is ahead. But now, I do not want to stay in one place. I want to move forward, so <em>Freelancing</em> is like freedom for me where I can get more experience in interesting field. I chose to work for foreign companies, where I can make a real value for company and for customers of company. My selection was <strong>TopTal</strong> because I strongly believe I am talented developer, who deserves to be among top talents. That is the reason I want to join to <a href=\"https://www.toptal.com/react\">Toptal React.js Engineering Community</a>.</p>\n<p> <em>Anyway</em>, I have just applied for TopTal, and tomorrow I am having an online meeting. I really like to get in and become one of top developers who work there.</p>\n<p> Thank you for reading!</p>"}}}]}},"pageContext":{"slug":"my-programming-experience"}}